app/views/courses/index.html.erb

          <form action="/<%=locale%>/courses" method="get">
              <label for="grade"><%=t('courses.select_grade_level')%></label>
---
SELECT "courses".* FROM "courses"

          <!-- single course -->
          <% course_teacher = User.find(course.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]