app/controllers/courses_controller.rb

  def create

    @course = Course.new(course_params)
    @course.user = current_user

    if @course.save
      params[:course_attachments]['image'].each do |img|
        @course_attachment = @course.course_attachments.create!(course_id: @course.id, image: img)
---
INSERT INTO "course_attachments" ("course_id", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["course_id", 1], ["image", "IMG_0076.JPG"], ["created_at", "2018-09-24 18:50:35.088316"], ["updated_at", "2018-09-24 18:50:35.088316"]]