app/controllers/courses_controller.rb

  def index
    #@courses = Course.find(params[:course_id])
    @current_user = current_user || nil
    if (params[:grade])
      @grade = Grade.where(level: params[:grade])
      @courses = @grade[0].courses.order(time: "ASC")

    else
      @courses = Course.order("RANDOM()").limit(3)
---
SELECT "courses".* FROM "courses"

  def show
    @course = Course.find(params[:id])
    @course_teacher = User.find(@course.user_id)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def create
    @teachers = User.where(role: 'teacher')
    @course = Course.new(course_params)
    @course.user_id = params[:course_instructor][:user_id]
    @course.grade_id = params[:grade][:grade_id]

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def edit
    @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @teachers = User.where(role: 'teacher')
    @grades = Grade.order(level: "ASC")
    @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]